#/usr/bin/perl

# ** 幂

# 数字比较
# ==: 比较运算
# 比较的结果为真或非零, 假或零
# <=>: 比较运算 $a<=>$b
# 当$a>$b时, 值为1
# 当$a<$b时, 值为-1
# 当$a==$b时, 值为0
# 自动把操作数转化为整数, 不能转化为整数则为0
# 浮点数不精确, 不要把值相近的数比较

# 字符串比较
# lt, gt, eq, le, ge, ne, cmp
# Cmp比较同 <=> 结果为1, -1, 0
# 空串, 0, Undef为假.

# 字符串连接(加), 重复(乘)
# . x
# 连接: $a='a'.'b'; => 'ab'
# 在print时可以直接写print $a$b=>print $a.$b;
# x: c重复x前后有空格(为了和变量名区分) 'a' x 5 = 'aaaaa'
# 如果重复次数<1, 则返回空串.

# 逻辑运算符
# &&(and), ||(or), !(not), xor
# 先算左边的值, 后算右边的值

<>;
print "\n对小数取余截取整数:\n";
$a = 25.6%7.6;
print $a;

<>;
print "\n指数为小数的幂运算:\n";
$b=(25)**1.5;
print $b;

<>;
print "\n字符串自增, 只在自己的序列增, 进位导致长度增加:\n";
$a='Z';
$a++;
print $a;

<>;
print "\n||和or的优先级不同:\n";
$a = 1;
$b = 1;
$c = ($a+=0 || $b);
print $c;

$a = 1;
$b = 1;
$c = ($a += 0 or $b);
print $c;

<>;
print "\n=运算符的结合性:";
$a=2, $b=1;
$a*=$b+=5;
print $a;

$a=2, $b=1;
($a*=$b)+=5;
print $a;

# 位运算
# &, |, ~, ^, <<, >>

# 自增, 自减
# 可用于字符串的自增, 当z, Z, 9时进位.
$a='az'; $a++;
# $a='ba';

# 不能用于字符串的自减, 当$a--时, 按数字运算, 字符先转化为0再自减, 结果都为-1.
# 如果字符串含有非字母数字符号, 或数字位于字母中时, 自增也先化为0再自增, 结果都为1.
$a='ab*c';
$a++;
$a='ab5c';
$a++;
# $a=1;

# 只能用于单一变量, 不能对运算后的变量进行.
# ($a+$b)++

# 逗号, 关系紧密的语句写到一行而已.
# $a+=1, $b=$a; => $a+=1; $b=$a;

# 条件运算符
# 条件?真:假






























